<template>

    <div class="VisionMissionSection pt-[120px] md:pt-[240px] relative">
        <div class="absolute top-0 left-0 w-full h-[calc(100%-162px)] bg-[#EFF2EF]"></div>
        <div class="container max-w-[1315px] mx-auto max-2xl:px-6 z-10 relative">
            <div class="grid grid-cols-1 md:grid-cols-2 justify-center  gap-6 items-stretch">
                <div class="Card boxShadow p-10 flex flex-col gap-4 bg-primary-500 rounded-3xl">
                    <div class="vision mb-2">
                        <svg width="44" height="44" viewBox="0 0 44 44" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M22 6.875C28.9327 7.50567 34.3182 10.0265 38.1562 14.4375C41.9943 18.8485 43.9423 21.3693 44 22C43.9423 22.6307 41.9943 25.1515 38.1562 29.5625C34.3182 33.9735 28.9327 36.4943 22 37.125C15.0673 36.4943 9.68183 33.9735 5.84375 29.5625C2.00567 25.1515 0.05775 22.6307 0 22C0.05775 21.3693 2.00567 18.8485 5.84375 14.4375C9.68183 10.0265 15.0673 7.50567 22 6.875ZM22 9.625C17.1298 9.94033 13.0766 11.5805 9.83984 14.5449C6.60311 17.5094 4.39685 19.9943 3.22168 22C4.39593 24.0057 6.60219 26.4906 9.83984 29.4551C13.0775 32.4195 17.1307 34.0597 22 34.375C26.8702 34.0597 30.9234 32.4195 34.1602 29.4551C37.3969 26.4906 39.6032 24.0057 40.7783 22C39.6041 19.9943 37.3978 17.5094 34.1602 14.5449C30.9225 11.5805 26.8693 9.94033 22 9.625ZM22 12.375C24.7216 12.4327 26.9919 13.3708 28.8105 15.1895C30.6292 17.0081 31.5673 19.2784 31.625 22C31.5673 24.7216 30.6292 26.9919 28.8105 28.8105C26.9919 30.6292 24.7216 31.5673 22 31.625C19.2784 31.5673 17.0081 30.6292 15.1895 28.8105C13.3708 26.9919 12.4327 24.7216 12.375 22C12.4327 19.2784 13.3708 17.0081 15.1895 15.1895C17.0081 13.3708 19.2784 12.4327 22 12.375ZM22 15.125C20.0521 15.1827 18.4334 15.8557 17.1445 17.1445C15.8557 18.4334 15.1827 20.0521 15.125 22C15.1827 23.9479 15.8557 25.5666 17.1445 26.8555C18.4334 28.1443 20.0521 28.8173 22 28.875C23.9479 28.8173 25.5666 28.1443 26.8555 26.8555C28.1443 25.5666 28.8173 23.9479 28.875 22C28.8173 20.0521 28.1443 18.4334 26.8555 17.1445C25.5666 15.8557 23.9479 15.1827 22 15.125Z"
                                fill="white" />
                        </svg>

                    </div>
                    <h1 class="text-white font-bold text-2xl md:text-[40px] md:leading-[72px]  mb-4 md:mb-6">رؤيتنا
                    </h1>
                    <p class="md:mb-6 text-white text-lg md:text-xl font-normal ">
                        أن تكون المرجع للخدمات القانونية وإدارة المعرفة القانونية (المحلية والعالمية) في قطاع الأعمال.

                    </p>
                </div>
                <div class="Card boxShadow p-10 flex flex-col gap-4 bg-primary-500 rounded-3xl">
                    <div class="mission mb-2">
                        <svg width="44" height="44" viewBox="0 0 44 44" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M40.9063 22C40.9063 32.4416 32.4416 40.9063 22 40.9063C11.5584 40.9063 3.09375 32.4416 3.09375 22C3.09375 11.5584 11.5584 3.09375 22 3.09375"
                                stroke="white" stroke-width="2.75" />
                            <path
                                d="M31.4531 22C31.4531 27.2209 27.2209 31.4531 22 31.4531C16.7792 31.4531 12.5469 27.2209 12.5469 22C12.5469 16.7792 16.7792 12.5469 22 12.5469"
                                stroke="white" stroke-width="2.75" />
                            <path d="M22 22L28.6172 15.3828" stroke="white" stroke-width="2.75" />
                            <path
                                d="M27.6719 10.6563L28.6172 15.3828L33.3438 16.3281L39.0156 10.6563L34.2891 9.71094L33.3438 4.98438L27.6719 10.6563Z"
                                stroke="white" stroke-width="2.75" />
                        </svg>

                    </div>
                    <h1 class="text-white font-bold text-2xl md:text-[40px] md:leading-[72px]  mb-4 md:mb-6">رسالتنا
                    </h1>
                    <p class="md:mb-6 text-white text-lg md:text-xl font-normal ">الشريك القانوني في رحلة المستثمر
                        المحلي والدولي.</p>
                </div>
            </div>
        </div>

    </div>
</template>

<script setup lang="ts">

</script>

<style scoped></style>