<template>
    <div>
        <header-img-section :img="ConsultingContracts" title="خدمات المشاريع" />
        <WhatTheService title="ما هي خدمات المشاريع ؟"
            desc="ما بين زمنين وتسلسل إجرائي محدد، يقع نطاق بالغ الأهمية لقطاع الأعمال يوصف مهنيا بالمشاريع، والتي قد تكون فكرة استثمارية يرافقها ما هو ذهني وقيمي، كالعلامات والنماذج، وما يضمن الاستمرار والنمو، كحماية المنتجات من التقليد وحصرية العمل في المشاريع عن طريق الوكالات والامتياز. ">
            <p class="text-text text-lg md:text-xl  font-normal flex flex-col  max-w-[1164px]">

                <span class="block ">



                    ومنها ما هو إجرائي كإصدار التراخيص والسجلات اللازمة لضمان قيام وعمل المنشآت التجارية بشكل نظامي.
                    ومنها ما يضمن سلامة الأعمال التجارية، كالاندماج، والاستحواذ، والتمويل لضمان استمرارية المنشآت وفقاً
                    لما تتطلبه القوانين في المملكة.
                </span>
                <br>
                <span class="block ">

                    تعد هذه المشاريع القانونية أهم أساليب المحافظة النظامية على قيمة ومكتسبات المشاريع التجارية
                    والاستثمارية، ومكون أصيل لجميع مراحل رحلة الاستثمار، ويجب توثيق تملكها وفقا لما حدده القانون مع
                    الرأي القانوني في أعمال المستثمر، وتدقيق الامتثال وفقاً لمتطلبات قوانين الاستثمار، نوظف خبرتنا
                    المتعمقة لدعم عملائنا في جميع الجوانب القانونية والاستراتيجية المتعلقة بمشاريعهم في قطاع الأعمال.

                </span>
            </p>

        </WhatTheService>
        <DetailedServiceSection title="خدماتنا التفصيلية" :details="Details" />
        <CTASection title="انت على بعد خطوة من حماية شاملة لشركتك. تواصل مع فريقنا المختص لطلب عرض مالي الآن"
            buttonO="اطلب عرض مالي" buttonT="احجز استشارة قانونية" :img="arbitration" />
        <!-- <OtherServicesSection /> -->
    </div>
</template>



<script setup lang="ts">
const Details = [
    "السجلات و التراخيص",
    "الاستثمار و الصفقات",
    "الملكية الفكرية",
    "الخدمات اللوجيستية",
]
import ConsultingContracts from "../assets/img/pannel/cta.webp"
import arbitration from "../assets/img/pannel/arbitration.webp"

</script>

<style scoped></style>