<template>
    <div>
        <header-img-section :img="ConsultingContracts" title="التقاضي والتحكيم" />
        <WhatTheService title="ما هي خدمات التقاضي والتحكيم ؟"
            desc="خدمة التقاضي والتحكيم هي عملية التمثيل القانوني التي يتم تقديمها للأفراد والشركات لحل المنازعات القانونية. تشمل هذه الخدمة الترافع أمام المحاكم على اختلاف أنواعها ودرجاتها، بالإضافة إلى تقديم الدعم اللازم في عمليات التحكيم أمام الهيئات المتخصصة."
            cardOTitle="الجانب الشكلي:"
            cardOdesc="يشمل ذلك فهم الإجراءات القضائية المتغيرة، والتعامل مع الوثائق الرسمية، وتقديم المرافعات في مواعيدها المحددة، وهو ما يتطلب يقظة قانونية دائمة."
            cardTTitle="الجانب الموضوعي:"
            cardTdesc="يتعلق هذا الجانب بالفهم العميق لأحكام القانون، وتطبيقها على وقائع النزاع، وصياغة الحجج القانونية القوية التي تدعم موقف العميل." />
        <DetailedServiceSection title="خدماتنا التفصيلية" :details="Details" />
        <CTASection title="لا تدع النزاعات تعيق تقدمك. تواصل معنا الآن لإيجاد حلول قانونية فعّالة" buttonO="اطلب خدمة"
            buttonT="احجز استشارة قانونية" :img="arbitration" />
        <OtherServicesSection />
    </div>
</template>



<script setup lang="ts">
const Details = [
    "القضايا الإدارية",
    "القضايا التجارية",
    "القضايا الإنشائية",
    "القضايا العمالية",
    "القضايا الجمركية",
    "قضايا المنافسة",
    "القضايا الدولية",
    "التحكيم",
    "القضايا الاقتصادية",
    "القضايا المدنية",
    "التحصيل",
]
import ConsultingContracts from "../assets/img/pannel/cta.webp"
import arbitration from "../assets/img/pannel/arbitration.webp"

</script>

<style scoped></style>