<template>
    <div>
        <header-img-section :img="ConsultingContracts" title="التقاضي والتحكيم" />
        <WhatTheService title="ما هي خدمات التقاضي والتحكيم ؟"
            desc="خدمة التقاضي والتحكيم هي عملية التمثيل القانوني التي يتم تقديمها للأفراد والشركات لحل المنازعات القانونية. تشمل هذه الخدمة الترافع أمام المحاكم على اختلاف أنواعها ودرجاتها، بالإضافة إلى تقديم الدعم اللازم في عمليات التحكيم أمام الهيئات المتخصصة.">
            <p class="text-text text-lg md:text-xl  font-normal flex flex-col  max-w-[1164px]">

                <span class="block ">


                    بموجب الحق الممنوح لنا من قانون المحاماة السعودي، عملنا منذ سنتنا الأولى على تطبيقات متراكمة في
                    السوق
                    السعودي مما عزز من مهاراتنا القانونية في مجال خدمات التقاضي، ومكننا من إدارة وتسوية العديد من
                    المنازعات
                    التي تكللت بالنجاح. لذا نهدف نحن في محمود الشنقيطي للمحاماة إلى توظيف خبرتنا لدعم عملائنا بالترافع
                    أمام
                    المحاكم أو الجهات شبه القضائية ومراكز وهيئات التحكيم.
                </span>
                <br>
                <span class="block ">
                    يتطلب التقاضي أمام القضاء السعودي تمكن من الشقين الشكلي والموضوعي بسبب طبيعته الاستثنائية. فالوثائق
                    الكبرى التي تم صياغتها كنظام القضاء تحمل في هذه الحقبة متغيرات سريعة بسبب طبيعة نصوص الوثيقة، والتي
                    يغلب
                    عليها التمرحل في إعادة تشكيل تصنيف القضايا والمحاكم بالسلخ أو الدمج أو تشكيل المحاكم الجديدة في جميع
                    الدرجات الابتدائية والاستئناف والعليا. وتوجد وثائق أخرى مكملة تتمثل في المبادئ والقرارات، والقواعد
                    التي
                    تصدر عن الجهات القضائية المختلفة، والتي قد لا تكون في متناول غير المختص.
                </span>
                <br>
                <span class="block ">

                    أكثر المشاهدات الخاطئة في فهم هذا الدور أن يسند التقاضي لمزود خدمة محلي غير مرخص وغير ملم بالمتغيرات
                    التشريعية والهيكلية من خارج المنشأة التجارية أو من داخلها، أو يسند لمزود خدمة غير محلي لا يملك
                    معايير
                    الاختيار، لأن هناك مسائل قد تكون شديدة التعقيد من وجهة نظر من هو خارج صندوق ملف النزاع، بينما الواقع
                    أن
                    تأصيلها من طرفنا كمزود للخدمة مختلف، وبالعكس قد تتم صياغة التوجه بتبسيط ما هو معقد وشائك. لذا نحن
                    نشدد
                    على أن قرار التكليف بالغ الأهمية ويجب أن يتخذ في شكل حوكمة رشيدة.

                </span>
                <br>
                <span>
                    من مسيرتنا المهنية الضليعة في إدارة عمليات النزاعات والتقاضي والتي هذبناها كمنتج معرفي مطبوع تحت
                    مسمى (مجموعة الأحكام) والذي يشمل جميع القضايا التي ترافعنا فيها، أصبح سهلاً على أي من أعضاء فريقنا
                    الرجوع إليها. لأن كل حكم بطبيعته يتضمن لائحة الدعوى وتفصيلاتها المحررة والمذكرات الجوابية المتبادلة
                    في القضية، ومذكرات الدفاع، والطلبات، والاستناد للقوانين الإطارية للقضية ولوائحها التنفيذية وكذلك
                    تسبيبات القضاة التي بني عليها الحكم ومنطوقه واللوائح الاستئنافية وتعقيبات محاكم الاستئناف أو تأييدها
                    ومحتواه ونحن نؤمن بأنها أكثر موثوقية من المصادر الأخرى لأنها صنعت بأيدينا.
                </span>
                <br>
                <span>
                    وقد استخلصنا بعد قرابة 20 عامًا كمزود لخدمات إدارة النزاعات في قطاع الأعمال وجه الشبه الكبير لأكثر
                    المحاكم المحلية ارتباطاً بالقطاع ابتداء من المحاكم التجارية، والإدارية، والعمالية، والحقوقية،
                    والقضايا الاقتصادية في مرحلتها الثانية أمام المحكمة الجزائية بعد النيابة العامة، وكذلك الأمر بالنسبة
                    للجان الإدارية ذات الاختصاص القضائي والتي قد تضطر المنشآت العاملة في القطاع المثول أمامها لحماية
                    نشاطها أو الدفاع عنه.
                </span>
                <br>
                <span>
                    لا تقتصر إدارة ملف النزاع على المحكمة، نحن نتماشى أيضا مع متطلبات الحفاظ على العلاقة بين المنشأة
                    وعملائها متى كان ذلك ممكنا بالوساطة المحترفة خارج أسوار المحكمة أو بتنفيذ التسويات أو اقتراحها
                    وتحليل جدواها. وفي حال كان النزاع مؤطراً بالتحكيم نقوم بتمثيل المنشأة - مُحتكمة كانت أو مُحتكم ضدها
                    - وفقاً لشروط التحكيم المتفق عليها أو بتحرير اتفاقية مشارطة تحكيم لاحقة للعقد.
                </span>
                <br>
                <span>
                    نحن نولّي اهتمامنا بجودة استراتيجية الدفاع في قالبها التكاملي، نرسمها وننفذها بعناية، وننقلها
                    بواقعية لموكلينا، ونشترك مع العميل في إدارة الملف في شكل تقارير دورية لتطورات الملف وتمرير اللوائح
                    والمذكرات والطلبات قبل اعتمادها بشكل نهائي أمام هيئة المحكمة ونسعى بكل جهد ألا تغيب مصلحة العميل في
                    هذا الحق في جميع مراحل القضية.
                </span>
            </p>


        </WhatTheService>


        <DetailedServiceSection title="خدماتنا التفصيلية" :details="Details" />
        <CTASection title="لا تدع النزاعات تعيق تقدمك. تواصل معنا الآن لإيجاد حلول قانونية فعّالة" buttonO="اطلب خدمة"
            buttonT="احجز استشارة قانونية" :img="arbitration" />
        <!-- <OtherServicesSection /> -->
    </div>
</template>



<script setup lang="ts">
const Details = [
    "القضايا الإدارية",
    "القضايا التجارية",
    "القضايا الإنشائية",
    "القضايا العمالية",
    "القضايا الجمركية",
    "قضايا المنافسة",
    "القضايا الدولية",
    "التحكيم",
    "القضايا الاقتصادية",
    "القضايا المدنية",
    "التحصيل",
]
import ConsultingContracts from "../assets/img/pannel/cta.webp"
import arbitration from "../assets/img/pannel/arbitration.webp"

</script>

<style scoped></style>